# 펜시 검색이란?

* 데이터 프레임에 직접 검색 레이블을 넣어서 특정 행 또는 열을 검색하는 방식

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic') #seaborn 라이브러리에 내장된 titanic 데이터셋을 데이터 프레임으로 로드

### Titanic 데이터셋 열(Column) 설명
| 컬럼명        | 설명 |
|--------------|------|
| survival     | 생존 여부 (0 = 사망, 1 = 생존) |
| pclass       | 선실 등급 (1 = 1등석, 2 = 2등석, 3 = 3등석) |
| sex          | 성별 |
| age          | 나이 (수치형, 일부 결측치 있음) |
| sibsp        | 함께 탑승한 형제/배우자 수 |
| parch        | 함께 탑승한 부모/자녀 수 |
| fare         | 운임 요금 |
| embarked     | 승선 항구 (C = Cherbourg, Q = Queenstown, S = Southampton) |
| class        | 선실 등급(문자열: First, Second, Third) |
| who          | 탑승객 구분 (man, woman, child) |
| adult_male   | 성인 남성 여부 (True / False) |
| deck         | 선실 갑판 (A ~ G, 일부 결측치 있음) |
| embark_town  | 승선 도시 (Cherbourg, Queenstown, Southampton) |
| alive        | 생존 여부(문자열: yes / no) |
| alone        | 혼자 탑승 여부 (True / False) |

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

* 단일 열 검색

In [4]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [7]:
titanic['adult_male']

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: adult_male, Length: 891, dtype: bool

* 펜시검색을 통한 다중 열 검색

문법] 데이터프레임[ [다중열이름 리스트] ]

age, sex, alive 열을 조회하려면?

In [8]:
titanic [ ['age','sex','alive'] ].head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

# 시리즈에서 펜시검색

- age 열 데이터 조회

In [9]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

* 0,3,4 번 행에 대한 펜시검색

In [20]:
titanic[['survived','age','sibsp']]

     survived   age  sibsp
0           0  22.0      1
1           1  38.0      1
2           1  26.0      0
3           1  35.0      1
4           0  35.0      0
..        ...   ...    ...
886         0  27.0      0
887         1  19.0      0
888         0   NaN      1
889         1  26.0      0
890         0  32.0      0

[891 rows x 3 columns]